Revit 2027 API
GenericZone.GetSpaceIds Method
 Gets a list of ElementIds of the associated spaces for the zone.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ISet<ElementId> GetSpaceIds()
Public Function GetSpaceIds As ISet(Of ElementId)
public:
ISet<ElementId^>^ GetSpaceIds()
member GetSpaceIds : unit -> ISet<ElementId>
Return Value
ISet<ElementId>
 The associated spaces for the space-based zone.
Exceptions
Exception | Condition
InvalidOperationException |  This generic zone must be space-based.
See Also
Reference
GenericZone Class
Autodesk.Revit.DB.Analysis Namespace